---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LeaderLine
source: html/16e7d26d-12f8-f8a1-fc57-1e6946ca48dc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LeaderLine Property

"Leader Line"

## Syntax (C#)
```csharp
public static ForgeTypeId LeaderLine { get; }
```